xiao6hu/test01/USB_MIDI_UC_OS2_20191020/2.9.0/CMSIS/Driver/OTG_FS_STM32F2xx.h
// OTG_FS device endpoint-x interrupt register (OTG_FS_DIEPINTx)
#define  OTG_FS_DIEPINTx_XFCR               ((uint32_t)    1U       )
#define  OTG_FS_DIEPINTx_EPDISD             ((uint32_t)    1U  <<  1)
#define  OTG_FS_DIEPINTx_TOC                ((uint32_t)    1U  <<  3)
#define  OTG_FS_DIEPINTx_ITTXFE             ((uint32_t)    1U  <<  4)
#define  OTG_FS_DIEPINTx_INEPNE             ((uint32_t)    1U  <<  6)
#define  OTG_FS_DIEPINTx_TXFE               ((uint32_t)    1U  <<  7)

// OTG_FS device endpoint-x interrupt register (OTG_FS_DOEPINTx)
#define  OTG_FS_DOEPINTx_XFCR               ((uint32_t)    1U       )
#define  OTG_FS_DOEPINTx_EPDISD             ((uint32_t)    1U  <<  1)
#define  OTG_FS_DOEPINTx_STUP               ((uint32_t)    1U  <<  3)
#define  OTG_FS_DOEPINTx_OTEPDIS            ((uint32_t)    1U  <<  4)
#define  OTG_FS_DOEPINTx_B2BSTUP            ((uint32_t)    1U  <<  6)

// OTG_FS device IN endpoint 0 transfer size register (OTG_FS_DIEPTSIZ0)
#define  OTG_FS_DIEPTSIZ0_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_FS_DIEPTSIZ0_XFRSIZ_MSK        ((uint32_t) 0x7FU       )
#define  OTG_FS_DIEPTSIZ0_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_FS_DIEPTSIZ0_XFRSIZ_MSK)
#define  OTG_FS_DIEPTSIZ0_PKTCNT_POS        ((uint32_t)           19U)
#define  OTG_FS_DIEPTSIZ0_PKTCNT_MSK        ((uint32_t)    3U  << OTG_FS_DIEPTSIZ0_PKTCNT_POS)
#define  OTG_FS_DIEPTSIZ0_PKTCNT(x)        (((uint32_t)    x   << OTG_FS_DIEPTSIZ0_PKTCNT_POS) & OTG_FS_DIEPTSIZ0_PKTCNT_MSK)

// OTG_FS device OUT endpoint 0 transfer size register (OTG_FS_DOEPTSIZ0)
#define  OTG_FS_DOEPTSIZ0_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_FS_DOEPTSIZ0_XFRSIZ_MSK        ((uint32_t) 0x7FU       )
#define  OTG_FS_DOEPTSIZ0_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_FS_DOEPTSIZ0_XFRSIZ_MSK)
#define  OTG_FS_DOEPTSIZ0_PKTCNT            ((uint32_t)    1U  << 19)
#define  OTG_FS_DOEPTSIZ0_STUPCNT_POS       ((uint32_t)           29U)
#define  OTG_FS_DOEPTSIZ0_STUPCNT_MSK       ((uint32_t)    3U  << OTG_FS_DOEPTSIZ0_STUPCNT_POS)
#define  OTG_FS_DOEPTSIZ0_STUPCNT(x)       (((uint32_t)    x   << OTG_FS_DOEPTSIZ0_STUPCNT_POS) & OTG_FS_DOEPTSIZ0_STUPCNT_MSK)

// OTG_FS device IN endpoints transver size register (OTG_FS_DIEPTSIZx)
#define  OTG_FS_DIEPTSIZx_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_FS_DIEPTSIZx_XFRSIZ_MSK        ((uint32_t)0x7FFFFU     )
#define  OTG_FS_DIEPTSIZx_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_FS_DIEPTSIZx_XFRSIZ_MSK)
#define  OTG_FS_DIEPTSIZx_PKTCNT_POS        ((uint32_t)           19U)
#define  OTG_FS_DIEPTSIZx_PKTCNT_MSK        ((uint32_t)0x3FFU  << OTG_FS_DIEPTSIZx_PKTCNT_POS)
#define  OTG_FS_DIEPTSIZx_PKTCNT(x)        (((uint32_t)    x   << OTG_FS_DIEPTSIZx_PKTCNT_POS) & OTG_FS_DIEPTSIZx_PKTCNT_MSK)
#define  OTG_FS_DIEPTSIZx_MCNT_POS          ((uint32_t)           29U)
#define  OTG_FS_DIEPTSIZx_MCNT_MSK          ((uint32_t)    3U  << OTG_FS_DIEPTSIZx_MCNT_POS)
#define  OTG_FS_DIEPTSIZx_MCNT(x)          (((uint32_t)    x   << OTG_FS_DIEPTSIZx_MCNT_POS) & OTG_FS_DIEPTSIZx_MCNT_MSK)

// OTG_FS device IN endpoint transmit FIFO status register (OTG_FS_DTXFSTSx)
#define  OTG_FS_DTXFSTSx_INEPTFSAV_POS      ((uint32_t)           0U)
#define  OTG_FS_DTXFSTSx_INEPTFSAV_MSK      ((uint32_t)0xFFFFU      )
#define  OTG_FS_DTXFSTSx_INEPTFSAV(x)      (((uint32_t)    x        ) & OTG_FS_DTXFSTSx_INEPTFSAV_MSK)

// OTG_FS device OUT endpoint-x transfer size register (OTG_FS_DOEPTSIZx)
#define  OTG_FS_DOEPTSIZx_XFRSIZ_POS        ((uint32_t)           0U)
#define  OTG_FS_DOEPTSIZx_XFRSIZ_MSK        ((uint32_t)0x7FFFFU     )
#define  OTG_FS_DOEPTSIZx_XFRSIZ(x)        (((uint32_t)    x        ) & OTG_FS_DOEPTSIZx_XFRSIZ_MSK)
#define  OTG_FS_DOEPTSIZx_PKTCNT_POS        ((uint32_t)           19U)
#define  OTG_FS_DOEPTSIZx_PKTCNT_MSK        ((uint32_t)0x3FFU  << OTG_FS_DOEPTSIZx_PKTCNT_POS)
#define  OTG_FS_DOEPTSIZx_PKTCNT(x)        (((uint32_t)    x   << OTG_FS_DOEPTSIZx_PKTCNT_POS) & OTG_FS_DOEPTSIZx_PKTCNT_MSK)
#define  OTG_FS_DOEPTSIZx_RXDPID_POS        ((uint32_t)           29U)
#define  OTG_FS_DOEPTSIZx_RXDPID_MSK        ((uint32_t)    3U  << OTG_FS_DOEPTSIZx_RXDPID_POS)
#define  OTG_FS_DOEPTSIZx_RXDPID(x)        (((uint32_t)    x   << OTG_FS_DOEPTSIZx_RXDPID_POS) & OTG_FS_DOEPTSIZx_RXDPID_MSK)
#define  OTG_FS_DOEPTSIZx_STUPCNT_POS       ((uint32_t)           29U)
#define  OTG_FS_DOEPTSIZx_STUPCNT_MSK       ((uint32_t)    3U  << OTG_FS_DOEPTSIZx_STUPCNT_POS)
#define  OTG_FS_DOEPTSIZx_STUPCNT(x)       (((uint32_t)    x   << OTG_FS_DOEPTSIZx_STUPCNT_POS) & OTG_FS_DOEPTSIZx_STUPCNT_MSK)

// OTG_FS power and gate clock gating control register (OTG_FS_PCGCCTL)
#define  OTG_FS_PCGCCTL_STPPCLK             ((uint32_t)    1U       )
#define  OTG_FS_PCGCCTL_GATEHCLK            ((uint32_t)    1U  <<  1)
#define  OTG_FS_PCGCCTL_PHYSUSP             ((uint32_t)    1U  <<  4)

// Global functions and variables exported by OTG_FS_STM32F7xx.c module
extern uint8_t otg_fs_role;

extern void OTG_FS_PinsConfigure   (uint8_t pins_mask);
extern void OTG_FS_PinsUnconfigure (uint8_t pins_mask);
extern void OTG_FS_PinVbusOnOff    (bool state);
extern bool OTG_FS_PinGetOC        (void);

extern void OTG_FS_IRQHandler      (void);

// Global functions and variables exported by driver .c module
extern void USBD_FS_IRQ (uint32_t gintsts);
extern void USBH_FS_IRQ (uint32_t gintsts);

extern ARM_DRIVER_USBD Driver_USBD0;
extern ARM_DRIVER_USBH Driver_USBH0;
